<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
	<dict>
		<key>Description</key>
		<string>Download recipe for the latest Robomongo.</string>
		<key>Identifier</key>
		<string>com.github.valdore86.download.RoboMongo</string>
		<key>Input</key>
		<dict>
			<key>NAME</key>
			<string>RoboMongo</string>
			<key>BASE_URL</key>
			<string>https://robomongo.org/download</string>
		</dict>
		<key>MinimumVersion</key>
		<string>0.5.2</string>
		<key>Process</key>
		<array>
			<dict>
				<key>Processor</key>
				<string>CURLTextSearcher</string>
				<key>Arguments</key>
				<dict>
					<key>url</key>
					<string>%BASE_URL%</string>
					<key>re_pattern</key>
					<string>&nbsp;Download&nbsp;.*?(https://download.robomongo.org/[0-9\.]+-rc[0-9]/osx/robomongo-[0-9\.]+-rc[0-9]-darwin-x86_64-[^\.]+.dmg)</string>
					<key>result_output_var_name</key>
					<string>search_url</string>
					<key>re_flags</key>
					<array>
						<string>DOTALL</string>
					</array>
				</dict>
			</dict>
			<dict>
				<key>Processor</key>
				<string>CURLDownloader</string>
				<key>Arguments</key>
				<dict>
					<key>url</key>
					<string>%search_url%</string>
					<key>filename</key>
					<string>%NAME%.dmg</string>
				</dict>
			</dict>
			<dict>
				<key>Processor</key>
				<string>EndOfCheckPhase</string>
			</dict>
		</array>
	</dict>
</plist>
