<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
	<dict>
		<key>Description</key>
		<string>Downloads the latest Robomongo and imports it in into Munki.</string>
		<key>Identifier</key>
		<string>com.github.valdore86.munki.RoboMongo</string>
		<key>Input</key>
		<dict>
			<key>MUNKI_REPO_SUBDIR</key>
			<string>apps/Paralect</string>
			<key>MUNKI_CATEGORY</key>
			<string>Developer</string>
			<key>NAME</key>
			<string>RoboMongo</string>
			<key>pkginfo</key>
			<dict>
				<key>catalogs</key>
				<array>
					<string>testing</string>
				</array>
				<key>category</key>
				<string>%MUNKI_CATEGORY%</string>
				<key>description</key>
				<string>Robo 3T — is a shell-centric cross-platform open source MongoDB management tool (i.e. Admin GUI).

					We are very happy to announce the release of Robo 3T 1.1 !

What's new in this release:
— MongoDB 3.4 support
— New NumberDecimal (Decimal128) data type support
— ECMAScript 2015 aka ES6 Support (Modernized JavaScript Implementation)
— Renaming Robomongo to Robo 3T
— Shell timeout is configurable on UI now 'Options->Change Shell Timeout'
— Fix for Robo 3T Shell Timeout Issue (silently, prematurely finishing long lasting scripts)
— Stability Improvement: Fix included to prevent a on start crash on MACOS Sierra
— Security Improvement: OpenSSL version upgrade to openssl-1.0.1u (22-Sep-2016)
— Tool chain upgrades: Modern C++14 features are enabled and usable for developers
				</string>
				<key>developer</key>
				<string>Paralect</string>
				<key>display_name</key>
				<string>Robo 3T</string>
				<key>name</key>
				<string>%NAME%</string>
				<key>unattended_install</key>
				<true/>
			</dict>
		</dict>
		<key>MinimumVersion</key>
		<string>0.6.1</string>
		<key>ParentRecipe</key>
		<string>com.github.valdore86.download.RoboMongo</string>
		<key>Process</key>
		<array>
			<dict>
				<key>Processor</key>
				<string>Versioner</string>
				<key>Arguments</key>
				<dict>
					<key>input_plist_path</key>
					<string>%pathname%/Robo 3T.app/Contents/Info.plist</string>
					<key>plist_version_key</key>
					<string>CFBundleVersion</string>
				</dict>
			</dict>
			<dict>
				<key>Processor</key>
				<string>MunkiPkginfoMerger</string>
				<key>Arguments</key>
				<dict>
					<key>additional_pkginfo</key>
					<dict>
						<key>version</key>
						<string>%version%</string>
					</dict>
				</dict>
			</dict>
			<dict>
				<key>Arguments</key>
				<dict>
					<key>pkg_path</key>
					<string>%pathname%</string>
					<key>repo_subdirectory</key>
					<string>%MUNKI_REPO_SUBDIR%</string>
					<key>version_comparison_key</key>
					<string>CFBundleVersion</string>
				</dict>
				<key>Processor</key>
				<string>MunkiImporter</string>
			</dict>
		</array>
	</dict>
</plist>
