<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
	<dict>
		<key>Description</key>
		<string>Download recipe for the latest devoloCockpit.</string>
		<key>Identifier</key>
		<string>com.github.valdore86.download.devoloCockpit</string>
		<key>Input</key>
		<dict>
			<key>NAME</key>
			<string>devoloCockpit</string>
		</dict>
		<key>MinimumVersion</key>
		<string>0.2.0</string>
		<key>Process</key>
		<array>
			<dict>
				<key>Processor</key>
				<string>URLTextSearcher</string>
				<key>Arguments</key>
				<dict>
					<key>url</key>
					<string>http://www.devolo.com/en/dLAN-software/devolo-Cockpit-simple-powerline-network-configuration</string>
					<key>re_pattern</key>
					<string>(/downloads/software/software-devolo-cockpit-mac-v[0-9]-[0-9]-[0-9].dmg)</string>
					<key>result_output_var_name</key>
					<string>url</string>
				</dict>
			</dict>
			<dict>
				<key>Arguments</key>
				<dict>
					<key>filename</key>
					<string>%NAME%.dmg</string>
				</dict>
				<key>Processor</key>
				<string>URLDownloader</string>
				<key>Arguments</key>
				<dict>
					<key>url</key>
					<string>http://www.devolo.com%url%</string>
				</dict>
			</dict>
			<dict>
				<key>Processor</key>
				<string>EndOfCheckPhase</string>
			</dict>
		</array>
	</dict>
</plist>