<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
	<dict>
		<key>Description</key>
		<string>Downloads PhilipsHueSync and imports in into Munki.</string>
		<key>Identifier</key>
		<string>com.github.valdore86.munki.PhilipsHueSync</string>
		<key>Input</key>
		<dict>
			<key>MUNKI_REPO_SUBDIR</key>
			<string>apps/Philips</string>
			<key>MUNKI_CATEGORY</key>
			<string>Utilities</string>
			<key>NAME</key>
			<string>PhilipsHueSync</string>
			<key>pkginfo</key>
			<dict>
				<key>catalogs</key>
				<array>
					<string>testing</string>
				</array>
				<key>category</key>
				<string>%MUNKI_CATEGORY%</string>
				<key>description</key>
				<string>Philips Hue Sync is a tool for PC or Mac which captures content you’re watching, listening to or playing and translates it into an immediate lightscript for an immersive experience.</string>
				<key>developer</key>
				<string>Microsoft</string>
				<key>name</key>
				<string>%NAME%</string>
				<key>unattended_install</key>
				<true/>
			</dict>
		</dict>
		<key>MinimumVersion</key>
    <string>1.0.4</string>
    <key>ParentRecipe</key>
    <string>com.github.valdore86.download.PhilipsHueSync</string>
    <key>Process</key>
    <array>
        <dict>
            <key>Arguments</key>
            <dict>
                <key>pkg_path</key>
                <string>%pathname%</string>
                <key>repo_subdirectory</key>
                <string>%MUNKI_REPO_SUBDIR%</string>
            </dict>
            <key>Processor</key>
            <string>MunkiImporter</string>
        </dict>
    </array>
</dict>
</plist>
