<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
	<dict>
		<key>Description</key>
		<string>Downloads the current release version of Azure Data Studio. and imports into Munki.</string>
		<key>Identifier</key>
		<string>com.github.valdore86.munki.azuredatestudio</string>
		<key>Input</key>
		<dict>
			<key>NAME</key>
			<string>Azure Data Studio</string>
			<key>MUNKI_REPO_SUBDIR</key>
			<string>apps/Azure Data Studio</string>
			<key>blocking_applications</key>
			<array>
				<string>Azure Data Studio</string>
			</array>
			<key>pkginfo</key>
			<dict>
				<key>catalogs</key>
				<array>
					<string>testing</string>
				</array>
				<key>category</key>
				<string>Utilities</string>
				<key>description</key>
				<string>Azure Data Studio is a data management tool that enables you to work with SQL Server, Azure SQL DB and SQL DW from Windows, macOS and Linux.</string>
				<key>developer</key>
				<string>Microsoft</string>
				<key>name</key>
				<string>%NAME%</string>
				<key>unattended_install</key>
				<true/>
			</dict>
		</dict>
		<key>MinimumVersion</key>
		<string>1.0.4</string>
		<key>ParentRecipe</key>
		<string>com.github.valdore86.download.azuredatestudio</string>
		<key>Process</key>
		<array>
			<dict>
				<key>Processor</key>
				<string>Versioner</string>
				<key>Arguments</key>
				<dict>
					<key>input_plist_path</key>
					<string>%RECIPE_CACHE_DIR%/%NAME%/Azure Data Studio.app/Contents/Info.plist</string>
					<key>plist_version_key</key>
					<string>CFBundleShortVersionString</string>
				</dict>
			</dict>
			<dict>
				<key>Processor</key>
				<string>DmgCreator</string>
				<key>Arguments</key>
				<dict>
					<key>dmg_root</key>
					<string>%RECIPE_CACHE_DIR%/%NAME%</string>
					<key>dmg_path</key>
					<string>%RECIPE_CACHE_DIR%/%NAME%.dmg</string>
				</dict>
			</dict>
			<dict>
				<key>Processor</key>
				<string>MunkiPkginfoMerger</string>
				<key>Arguments</key>
				<dict>
					<key>additional_pkginfo</key>
					<dict>
						<key>version</key>
						<string>%version%</string>
					</dict>
				</dict>
			</dict>
			<dict>
				<key>Arguments</key>
				<dict>
					<key>pkg_path</key>
					<string>%dmg_path%</string>
					<key>repo_subdirectory</key>
					<string>%MUNKI_REPO_SUBDIR%</string>
					<key>version_comparison_key</key>
					<string>CFBundleShortVersionString</string>
				</dict>
				<key>Processor</key>
				<string>MunkiImporter</string>
			</dict>
		</array>
	</dict>
</plist>
