<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
	<dict>
		<key>Description</key>
		<string>Download recipe for the latest CommanderOne.</string>
		<key>Identifier</key>
		<string>com.github.valdore86.download.CommanderOne</string>
		<key>Input</key>
		<dict>
			<key>NAME</key>
			<string>CommanderOne</string>
			<key>URL</key>
			<string>https://mac.eltima.com/download/commander.dmg</string>
		</dict>
		<key>MinimumVersion</key>
		<string>0.6.1</string>
		<key>Process</key>
		<array>
			<dict>
				<key>Processor</key>
				<string>URLDownloader</string>
				<key>Arguments</key>
				<dict>
					<key>url</key>
					<string>%URL%</string>
					<key>filename</key>
					<string>%NAME%.dmg</string>
				</dict>
			</dict>
			<dict>
				<key>Processor</key>
				<string>CodeSignatureVerifier</string>
				<key>Arguments</key>
				<dict>
					<key>input_path</key>
					<string>%RECIPE_CACHE_DIR%/downloads/%NAME%.dmg/Commander One.app</string>
					<key>requirement</key>
					<string>anchor apple generic and identifier "com.eltima.cmd1" and (certificate leaf[field.1.2.840.113635.100.6.1.9] /* exists */ or certificate 1[field.1.2.840.113635.100.6.2.6] /* exists */ and certificate leaf[field.1.2.840.113635.100.6.1.13] /* exists */ and certificate leaf[subject.OU] = N7U4HGP254)</string>
				</dict>
			</dict>
			<dict>
				<key>Processor</key>
				<string>EndOfCheckPhase</string>
			</dict>
		</array>
	</dict>
</plist>
