<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
	<dict>
		<key>Description</key>
		<string>Download recipe for the latest Universal Media Server Java8.</string>
		<key>Identifier</key>
		<string>com.github.valdore86.download.UniversalMediaServerJava8</string>
		<key>Input</key>
		<dict>
			<key>NAME</key>
			<string>UniversalMediaServerJava8</string>
			<key>BASE_URL</key>
			<string>http://www.universalmediaserver.com</string>
			<key>DOWNLOAD_URL</key>
			<string>http://sourceforge.net/projects/unimediaserver/files/Official%20Releases/OS%20X/</string>
		</dict>
		<key>MinimumVersion</key>
		<string>0.4.2</string>
		<key>Process</key>
		<array>
			<dict>
				<key>Processor</key>
				<string>CURLTextSearcher</string>
				<key>Arguments</key>
				<dict>
					<key>url</key>
					<string>%BASE_URL%</string>
					<key>re_pattern</key>
					<string>(UMS-[0-9\.]+-Java8.dmg/download)</string>
					<key>result_output_var_name</key>
					<string>search_url</string>
				</dict>
			</dict>
			<dict>
				<key>Processor</key>
				<string>CURLDownloader</string>
				<key>Arguments</key>
				<dict>
					<key>url</key>
					<string>%DOWNLOAD_URL%%search_url%</string>
					<key>filename</key>
					<string>%NAME%.dmg</string>
				</dict>
			</dict>
			<dict>
				<key>Processor</key>
				<string>EndOfCheckPhase</string>
			</dict>
		</array>
	</dict>
</plist>
