<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
	<dict>
		<key>Description</key>
		<string>Download recipe for the latest Universal Media Server Java8.</string>
		<key>Identifier</key>
		<string>com.github.valdore86.download.UniversalMediaServerJava8</string>
		<key>Input</key>
		<dict>
			<key>NAME</key>
			<string>UniversalMediaServerJava8</string>
			<key>URL</key>
			<string>https://download.fosshub.com/Protected/expiretime=1466709393;badurl=aHR0cDovL3d3dy5mb3NzaHViLmNvbS9Vbml2ZXJzYWwtTWVkaWEtU2VydmVyLmh0bWw=/0b8acbeeb356387ba78f5d4791d28ca2c9dd9fdf54bf1da920a325efaadef86a/Universal-Media-Server/UMS-6.3.2-Java8.dmg</string>
		</dict>
		<key>MinimumVersion</key>
		<string>0.6.1</string>
		<key>Process</key>
		<array>
			<dict>
				<key>Processor</key>
				<string>CURLTextSearcher</string>
				<key>Arguments</key>
				<dict>
					<key>url</key>
					<string>http://www.fosshub.com/Universal-Media-Server.html</string>
					<key>re_pattern</key>
					<string>(UMS-[0-9\.]+-Java8.dmg)</string>
					<key>result_output_var_name</key>
					<string>dmg</string>
				</dict>
			</dict>
			<dict>
				<key>Processor</key>
				<string>CURLDownloader</string>
				<key>Arguments</key>
				<dict>
					<key>url</key>
					<string>%URL%</string>
					<key>filename</key>
					<string>%NAME%.dmg</string>
				</dict>
			</dict>
			<dict>
				<key>Processor</key>
				<string>EndOfCheckPhase</string>
			</dict>
		</array>
	</dict>
</plist>
