<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>Description</key>
	<string>Verify recipe for KeePassX.</string>
	<key>Identifier</key>
	<string>com.github.valdore86.verify.KeePassX</string>
	<key>Input</key>
	<dict>
		<key>KEYID</key>
		<string>FE22C6FD83135D45</string>
		<key>NAME</key>
		<string>KeePassX</string>
	</dict>
	<key>MinimumVersion</key>
	<string>1.0.4</string>
	<key>ParentRecipe</key>
	<string>com.github.valdore86.download.KeePassX</string>
	<key>Process</key>
	<array>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>filename</key>
				<string>%NAME%.dmg.sig</string>
				<key>url</key>
				<string>%url%.sig</string>
			</dict>
			<key>Processor</key>
			<string>URLDownloader</string>
		</dict>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>distribution_file</key>
				<string>%RECIPE_CACHE_DIR%/downloads/%NAME%.dmg</string>
				<key>public_key_id</key>
				<string>%KEYID%</string>
				<key>signature_file</key>
				<string>%RECIPE_CACHE_DIR%/downloads/%NAME%.dmg.sig</string>
			</dict>
			<key>Processor</key>
			<string>com.github.autopkg.gerardkok-recipes.SharedProcessors/GPGSignatureVerifier</string>
		</dict>
	</array>
</dict>
</plist>
