<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
	<dict>
		<key>Description</key>
		<string>Download recipe for Things.</string>
		<key>Identifier</key>
		<string>com.github.valdore86.download.Things3</string>
		<key>Input</key>
		<dict>
			<key>NAME</key>
			<string>Things</string>
			<key>URL</key>
			<string>https://culturedcode.cachefly.net/things/Things3.zip</string>
		</dict>
		<key>MinimumVersion</key>
		<string>0.6.1</string>
		<key>Process</key>
		<array>
			<dict>
				<key>Processor</key>
				<string>URLDownloader</string>
				<dict>
					<key>url</key>
					<string>%URL%</string>
				</dict>
			</dict>
			<dict>
				<key>Processor</key>
				<string>EndOfCheckPhase</string>
			</dict>
		</array>
	</dict>
</plist>
