<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
	<dict>
		<key>Description</key>
		<string>Downloads the current release version of Visual Studio Code.</string>
		<key>Identifier</key>
		<string>com.github.valdore86.download.visualstudiocode</string>
		<key>Input</key>
		<dict>
			<key>NAME</key>
			<string>Visual Studio Code</string>
		</dict>
		<key>MinimumVersion</key>
		<string>0.6.1</string>
		<key>Process</key>
		<array>
			<!--Sadly GitHubReleasesInfoProvider gives back - Error: No releases found for repo 'Microsoft/vscode'
			<dict>
                    <key>Processor</key>
                    <string>GitHubReleasesInfoProvider</string>
                    <key>Arguments</key>
                    <dict>
												<key>sort_by_highest_tag_names</key>
												<true/>
                        <key>github_repo</key>
                        <string>Microsoft/vscode</string>
                    </dict>
        </dict>-->
			<dict>
				<key>Processor</key>
				<string>CURLDownloader</string>
				<key>Arguments</key>
				<dict>
					<key>url</key>
					<string>https://az764295.vo.msecnd.net/stable/e6b4afa53e9c0f54edef1673de9001e9f0f547ae/VSCode-darwin-stable.zip</string>
					<!--<string>%url%</string>-->
					<key>filename</key>
					<string>vscode.zip</string>
				</dict>
			</dict>
			<dict>
				<key>Processor</key>
				<string>EndOfCheckPhase</string>
			</dict>
		</array>
	</dict>
</plist>
