<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
	<dict>
		<key>Description</key>
		<string>Downloads the current release version of Visual Studio Code.</string>
		<key>Identifier</key>
		<string>com.github.valdore86.download.visualstudiocode</string>
		<key>Input</key>
		<dict>
			<key>NAME</key>
			<string>Visual Studio Code</string>
		</dict>
		<key>MinimumVersion</key>
		<string>0.5.2</string>
		<key>Process</key>
		<array>
			<dict>
				<key>Processor</key>
				<string>CURLTextSearcher</string>
				<key>Arguments</key>
				<dict>
					<key>url</key>
					<string>https://github.com/Microsoft/vscode/releases/latest</string>
					<key>re_pattern</key>
					<string>/Microsoft/vscode/archive/([0-12\.]+[0-9]+[^\.]+).zip</string>
					<key>result_output_var_name</key>
					<string>version</string>
				</dict>
			</dict>
			<dict>
				<key>Processor</key>
				<string>CURLDownloader</string>
				<key>Arguments</key>
				<dict>
					<key>url</key>
					<string>https://az764295.vo.msecnd.net/stable/809e7b30e928e0c430141b3e6abf1f63aaf55589/VSCode-darwin-stable.zip</string>
					<key>filename</key>
					<string>vscode.zip</string>
				</dict>
			</dict>
			<dict>
				<key>Processor</key>
				<string>EndOfCheckPhase</string>
			</dict>
		</array>
	</dict>
</plist>
