<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
	<dict>
		<key>Description</key>
		<string>Download recipe for Things.</string>
		<key>Identifier</key>
		<string>com.github.valdore86.download.Things</string>
		<key>Input</key>
		<dict>
			<key>NAME</key>
			<string>Things</string>
			<key>SPARKLE_FEED_URL</key>
			<string>http://culturedcode.cachefly.net/things/sparkle/sparkle_en.xml</string>
		</dict>
		<key>MinimumVersion</key>
		<string>0.4.2</string>
		<key>Process</key>
		<array>
			<dict>
				<key>Processor</key>
				<string>SparkleUpdateInfoProvider</string>
				<key>Arguments</key>
				<dict>
					<key>appcast_url</key>
					<string>%SPARKLE_FEED_URL%</string>
				</dict>
			</dict>
			<dict>
				<key>Processor</key>
				<string>URLDownloader</string>
			</dict>
			<dict>
				<key>Processor</key>
				<string>EndOfCheckPhase</string>
			</dict>
		</array>
	</dict>
</plist>
