<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>Description</key>
	<string>Downloads VirtualBox and imports into Munki.</string>
	<key>Identifier</key>
	<string>com.github.valdore86.munki.VirtualboxExtpack</string>
	<key>Input</key>
	<dict>
		<key>MUNKI_CATEGORY</key>
		<string>Virtualization</string>
		<key>MUNKI_REPO_SUBDIR</key>
		<string>apps/VirtualBox</string>
		<key>NAME</key>
		<string>VirtualBoxExtPack</string>
		<key>pkginfo</key>
		<dict>
			<key>catalogs</key>
			<array>
				<string>testing</string>
			</array>
			<key>category</key>
			<string>%MUNKI_CATEGORY%</string>
			<key>description</key>
			<string>Oracle VirtualBox Extension Pack: Support for USB 2.0 devices, VirtualBox RDP and PXE boot for Intel cards.</string>
			<key>developer</key>
			<string>Oracle</string>
			<key>display_name</key>
			<string>VirtualBox Extension Pack</string>
			<key>name</key>
			<string>%NAME%</string>
			<key>unattended_install</key>
			<true/>
		</dict>
	</dict>
	<key>MinimumVersion</key>
	<string>1.0.4</string>
	<key>ParentRecipe</key>
	<string>com.github.valdore86.download.VirtualboxExtpack</string>
	<key>Process</key>
	<array>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>warning_message</key>
				<string>
This recipe is no longer maintained and will be removed after June 2026. If you are interested in taking over this recipe, please get in touch.
				</string>
			</dict>
			<key>Processor</key>
			<string>DeprecationWarning</string>
		</dict>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>re_pattern</key>
				<string>https://download.virtualbox.org/virtualbox/([0-9\.]+)/VirtualBox-[0-9\.]+-[0-999999\.]+-OSX.dmg</string>
				<key>result_output_var_name</key>
				<string>virtualbox_version</string>
				<key>url</key>
				<string>https://www.virtualbox.org/wiki/Downloads/</string>
			</dict>
			<key>Processor</key>
			<string>URLTextSearcher</string>
		</dict>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>dmg_path</key>
				<string>%RECIPE_CACHE_DIR%/%NAME%.dmg</string>
				<key>dmg_root</key>
				<string>%pathname%</string>
			</dict>
			<key>Processor</key>
			<string>DmgCreator</string>
		</dict>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>additional_pkginfo</key>
				<dict>
					<key>installcheck_script</key>
					<string>#!/bin/sh

VBM=/usr/local/bin/VBoxManage

if [ ! -f $VBM ]
then
	echo 'VBoxManage not present'
	exit 0
fi

extpackoutput=`mktemp -t extpack`

$VBM list extpacks | /usr/bin/grep -A 1 'Oracle VM VirtualBox Extension Pack' \
	&gt; "$extpackoutput"

if [ $? -ne 0 ]
then
	echo "No Extension Pack found in output of $VBM list extpacks"

	rm -f "$extpackoutput"
	exit 0
fi

installedver=`cat "$extpackoutput" | /usr/bin/tail -1 | /usr/bin/awk '{print $2}'`

rm -f "$extpackoutput"

if [ "x$installedver" != "x%virtualbox_version%" ]
then
	echo "Version mismatch of installed version ($installedver) and expected (%virtualbox_version%)"
	exit 0
fi

echo 'Extension pack versions appear to match'
exit 1</string>
					<key>postinstall_script</key>
					<string>#!/bin/sh

VBM=/usr/local/bin/VBoxManage

if [ ! -f $VBM ]
then
	echo 'VBoxManage not present'
	exit 1
fi

echo y | $VBM extpack install --replace \
	/tmp/Oracle_VM_VirtualBox_Extension_Pack.vbox-extpack

exit $?
</string>
					<key>requires</key>
					<array>
						<string>VirtualBox-%virtualbox_version%</string>
					</array>
					<key>update_for</key>
					<array>
						<string>VirtualBox</string>
					</array>
					<key>version</key>
					<string>%virtualbox_version%</string>
				</dict>
			</dict>
			<key>Processor</key>
			<string>MunkiPkginfoMerger</string>
		</dict>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>additional_makepkginfo_options</key>
				<array>
					<string>-i</string>
					<string>Oracle_VM_VirtualBox_Extension_Pack.vbox-extpack</string>
					<string>--destinationpath</string>
					<string>/tmp</string>
				</array>
				<key>pkg_path</key>
				<string>%RECIPE_CACHE_DIR%/%NAME%.dmg</string>
				<key>repo_subdirectory</key>
				<string>%MUNKI_REPO_SUBDIR%</string>
			</dict>
			<key>Processor</key>
			<string>MunkiImporter</string>
		</dict>
	</array>
</dict>
</plist>
