<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
	<dict>
		<key>Description</key>
		<string>Downloads the latest version of Virtualbox.</string>
		<key>Identifier</key>
		<string>com.github.valdore86.download.VirtualboxExtpack</string>
		<key>Input</key>
		<dict>
			<key>NAME</key>
			<string>VirtualBoxExtPack</string>
		</dict>
		<key>MinimumVersion</key>
		<string>1.0.4</string>
		<key>Process</key>
		<array>
			<dict>
				<key>Processor</key>
				<string>URLTextSearcher</string>
				<key>Arguments</key>
				<dict>
					<key>url</key>
					<string>https://www.virtualbox.org/wiki/Downloads/</string>
					<key>re_pattern</key>
					<string>(https://download.virtualbox.org/virtualbox/[0-9\.]+/Oracle_VM_VirtualBox_Extension_Pack-[0-9\.]+\.vbox-extpack)</string>
					<key>result_output_var_name</key>
					<string>url</string>
				</dict>
			</dict>
			<dict>
				<key>Processor</key>
				<string>URLDownloader</string>
				<key>Arguments</key>
				<dict>
					<key>url</key>
					<string>%url%</string>
					<key>CHECK_FILESIZE_ONLY</key>
					<true/>
					<key>filename</key>
					<string>Oracle_VM_VirtualBox_Extension_Pack.vbox-extpack</string>
				</dict>
			</dict>
			<dict>
				<key>Processor</key>
				<string>EndOfCheckPhase</string>
			</dict>
		</array>
	</dict>
</plist>
