<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
	<dict>
		<key>Description</key>
		<string>Download recipe for the latest Robomongo.</string>
		<key>Identifier</key>
		<string>com.github.valdore86.download.RoboMongo</string>
		<key>Input</key>
		<dict>
			<key>NAME</key>
			<string>RoboMongo</string>
		</dict>
		<key>MinimumVersion</key>
		<string>1.0.4</string>
		<key>Process</key>
		<array>
			<dict>
                <key>Processor</key>
                <string>GitHubReleasesInfoProvider</string>
                <key>Arguments</key>
                <dict>
					<key>asset_regex</key>
					<string>robo3t.*dmg</string>
                    <key>github_repo</key>
                    <string>Studio3T/robomongo</string>
                </dict>
            </dict>
			<dict>
				<key>Processor</key>
				<string>URLDownloader</string>
				<key>Arguments</key>
				<dict>
					<key>filename</key>
					<string>%NAME%.dmg</string>
				</dict>
			</dict>
			<dict>
				<key>Processor</key>
				<string>EndOfCheckPhase</string>
			</dict>
		</array>
	</dict>
</plist>
