<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
    <key>Description</key>
    <string>Downloads the latest version of MySQLWorkBench.</string>
    <key>Identifier</key>
    <string>com.github.valdore86.download.MySQLWorkbench</string>
    <key>Input</key>
    <dict>
        <key>NAME</key>
        <string>MySQLWorkBench</string>
	</dict>
    <key>MinimumVersion</key>
    <string>0.4.0</string>
    <key>Process</key>
    <array>
		<dict>
            <key>Processor</key>
            <string>URLTextSearcher</string>
            <key>Arguments</key>
            <dict>
                <key>url</key>
                <string>http://dev.mysql.com/downloads/file.php?id=457796</string>
                <key>re_pattern</key>
                <string>(/get/Downloads/MySQLGUITools/mysql-workbench-community-[6-9].[0-9].[0-9]-osx-x86_64.dmg)</string>
		<key>result_output_var_name</key>
		<string>url</string>
            </dict>
        </dict>
        <dict>
            <key>Processor</key>
            <string>URLDownloader</string>
            <key>Arguments</key>
            <dict>
                <key>url</key>
                <string>http://dev.mysql.com%url%</string>
                <key>filename</key>
                <string>%NAME%.dmg</string>
	    </dict>
        </dict>
        <dict>
            <key>Processor</key>
            <string>EndOfCheckPhase</string>
        </dict>
    </array>
</dict>
</plist>
